Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationPointOnLine_t
Struct for a tolerated point on a line.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationPointOnLine_t.Id
ID of the object on which the tolerated point exists.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationPointOnLine_t.SubId
SubID of the object on which the tolerated point exists.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationPointOnLine_t.ObjectType
Object type of the object on which the tolerated point exists.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationPointOnLine_t.HitPoint
The tolerated point.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationPointOnLine_t.LinePoint1
First point on the tolerated line. The line is clipped so
the line point only gives direction, not length.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationPointOnLine_t.LinePoint2
Second point on the tolerated line. The line is clipped so
the line point only gives direction, not length.